DataProcessors/СервисДеск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СервисДеск</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменFirestore</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыСервисДеск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыСервисДеск</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>opened</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>completed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>closed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>reopened</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>not_assigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>waiting_15_minutes</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СервисДеск/Forms/ФормаЗаявкиДемо/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номер = 987654321;
	Дата = ТекущаяДата()-7*86400;
	Описание = "Тестовая заявка"+Символы.ПС+"Покрасить все в желтый цвет"+Символы.ПС+"Надо быстро";
	Точка = Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("S224");
	Инициатор = Справочники.ФизическиеЛица.НайтиПоКоду("2656500853");
	Исполнитель = Справочники.ФизическиеЛица.НайтиПоКоду("2851507679");
	Услуга = Справочники.УслугиСервисДеск.НайтиПоКоду("000000028");
	//Категория = Заявка.ПолноеНаименование();
	Категория = ?(ЗначениеЗаполнено(Услуга.Родитель.Родитель),Строка(Услуга.Родитель.Родитель)+" / ","")+Услуга.Родитель;
	ВремяВыполнения = Услуга.ВремяВыполнения;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.СтатусыСервисДеск.opened,4);
	СоответствиеКартинки.Вставить(Перечисления.СтатусыСервисДеск.completed,5);
	СоответствиеКартинки.Вставить(Перечисления.СтатусыСервисДеск.closed,7);
	СоответствиеКартинки.Вставить(Перечисления.СтатусыСервисДеск.reopened,8);
	
	стрИстории = История.Добавить();
	стрИстории.Дата = Дата;
	стрИстории.Сотрудник = Инициатор;
	стрИстории.Статус = Перечисления.СтатусыСервисДеск.opened;
	стрИстории.ИндексСтатуса = СоответствиеКартинки.Получить(стрИстории.Статус);
	стрИстории.Комментарий = Описание;
	стрИстории.Фото = "https://photosvisitors.s3.amazonaws.com/external_0000012";
	
	стрИстории = История.Добавить();
	стрИстории.Дата = Дата + 86401;
	стрИстории.Сотрудник = Исполнитель;
	стрИстории.Статус = Перечисления.СтатусыСервисДеск.completed;
	стрИстории.ИндексСтатуса = СоответствиеКартинки.Получить(стрИстории.Статус);
	стрИстории.Комментарий = "Поздно увидел заявку";
	стрИстории.Фото = "https://photosvisitors.s3.amazonaws.com/external_0000017";
	
	стрИстории = История.Добавить();
	стрИстории.Дата = Дата +90000;
	стрИстории.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду("3070707357");
	стрИстории.Статус = Перечисления.СтатусыСервисДеск.reopened;
	стрИстории.ИндексСтатуса = СоответствиеКартинки.Получить(стрИстории.Статус);
	стрИстории.Комментарий = "Все сделано через одно место!!!";
	стрИстории.Фото = "https://photosvisitors.s3.amazonaws.com/external_0000500;https://photosvisitors.s3.amazonaws.com/external_0000099;https://photosvisitors.s3.amazonaws.com/external_0000088";
	
	стрИстории = История.Добавить();
	стрИстории.Дата = Дата + 160000;
	стрИстории.Сотрудник = Исполнитель;
	стрИстории.Статус = Перечисления.СтатусыСервисДеск.completed;
	стрИстории.ИндексСтатуса = СоответствиеКартинки.Получить(стрИстории.Статус);
	стрИстории.Комментарий = "Я красава";
	стрИстории.Фото = "https://photosvisitors.s3.amazonaws.com/external_0000099";
	
	стрИстории = История.Добавить();
	стрИстории.Дата = Дата +160500;
	стрИстории.Сотрудник = Справочники.ФизическиеЛица.НайтиПоКоду("3070707357");
	стрИстории.Статус = Перечисления.СтатусыСервисДеск.closed;
	стрИстории.ИндексСтатуса = СоответствиеКартинки.Получить(стрИстории.Статус);
	стрИстории.Комментарий = "Все ОК";
	стрИстории.Фото = "https://photosvisitors.s3.amazonaws.com/external_0000117";
	
	
	Статус = История[История.Количество()-1].Статус;
	
	Заголовок = СтрШаблон("Заявка № %1 от %2 г. %3",Номер,Формат(Дата,"ДФ=dd.MM.yyyy"),Статус);
	
	Если ДеньНедели(Дата) > 5 Тогда
		Элементы.ДеньНедели.ЦветТекста = ЦветаСтиля.ВидДняПроизводственногоКалендаряВоскресеньеЦвет;
	Иначе
		Элементы.ДеньНедели.ЦветТекста = ЦветаСтиля.ВидДняПроизводственногоКалендаряПредпраздничныйЦвет;
	КонецЕсли;
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыСервисДеск.opened,WebЦвета.Оранжевый);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыСервисДеск.completed,WebЦвета.Зеленый);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыСервисДеск.closed,WebЦвета.КоролевскиГолубой);
	СоответствиеСтатусов.Вставить(Перечисления.СтатусыСервисДеск.reopened,WebЦвета.ОрхидеяНейтральный);
	
	Элементы.Статус.ЦветТекста = СоответствиеСтатусов.Получить(Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.История.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		//При активизации строки ТекДанные не заполонены
		Элементы.Техника.ОтборСтрок = Неопределено;
	Иначе
		СсылкиФото = ТекДанные.Фото;
		СсылкиНаФото.Очистить();
		мСсылокнафото = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СсылкиФото,";");
		Для Каждого СсылкаНаФото Из мСсылокнафото Цикл
			СсылкиНаФото.Добавить(СсылкаНаФото);			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкиНаФотоПриАктивизацииСтроки(Элемент)
	Фото = Элементы.СсылкиНаФото.ТекущиеДанные.Значение;
КонецПроцедуры
